---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.IsEqual(Autodesk.Revit.DB.PointClouds.PointCloudColorSettings)
source: html/b1009e0d-d8b2-dc1c-0a45-8fa52b4bfa89.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudColorSettings.IsEqual Method

Check if the contents of two settings are equal.

## Syntax (C#)
```csharp
public bool IsEqual(
	PointCloudColorSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.PointClouds.PointCloudColorSettings`) - The settings to be compared.

## Returns
True for equal, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null